{"modelTopology":{"class_name":"Model","config":{"name":"recreated_model","layers":[{"name":"name_input","class_name":"InputLayer","config":{"batch_input_shape":[null,15],"dtype":"int32","sparse":false,"name":"name_input"},"inbound_nodes":[]},{"name":"text_embedding","class_name":"Embedding","config":{"input_dim":9607,"output_dim":100,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"text_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["name_input",0,0,{}]]]},{"name":"flattened_name","class_name":"Flatten","config":{"name":"flattened_name","trainable":true},"inbound_nodes":[[["text_embedding",0,0,{}]]]},{"name":"start_time_input","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"start_time_input"},"inbound_nodes":[]},{"name":"end_time_input","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"end_time_input"},"inbound_nodes":[]},{"name":"concatenated_features_layer","class_name":"Concatenate","config":{"axis":-1,"name":"concatenated_features_layer","trainable":true},"inbound_nodes":[[["flattened_name",0,0,{}],["start_time_input",0,0,{}],["end_time_input",0,0,{}]]]},{"name":"shared_dense_1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"shared_dense_1","trainable":true},"inbound_nodes":[[["concatenated_features_layer",0,0,{}]]]},{"name":"shared_dropout_1","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"shared_dropout_1","trainable":true},"inbound_nodes":[[["shared_dense_1",0,0,{}]]]},{"name":"shared_dense_2","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"shared_dense_2","trainable":true},"inbound_nodes":[[["shared_dropout_1",0,0,{}]]]},{"name":"shared_dropout_2","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"shared_dropout_2","trainable":true},"inbound_nodes":[[["shared_dense_2",0,0,{}]]]},{"name":"category_output","class_name":"Dense","config":{"units":6,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"category_output","trainable":true},"inbound_nodes":[[["shared_dropout_2",0,0,{}]]]},{"name":"subcategory_output","class_name":"Dense","config":{"units":15,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"subcategory_output","trainable":true},"inbound_nodes":[[["shared_dropout_2",0,0,{}]]]}],"input_layers":[["name_input",0,0],["start_time_input",0,0],["end_time_input",0,0]],"output_layers":[["category_output",0,0],["subcategory_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"text_embedding/embeddings","shape":[9607,100],"dtype":"float32"},{"name":"shared_dense_1/kernel","shape":[1508,128],"dtype":"float32"},{"name":"shared_dense_1/bias","shape":[128],"dtype":"float32"},{"name":"shared_dense_2/kernel","shape":[128,64],"dtype":"float32"},{"name":"shared_dense_2/bias","shape":[64],"dtype":"float32"},{"name":"category_output/kernel","shape":[64,6],"dtype":"float32"},{"name":"category_output/bias","shape":[6],"dtype":"float32"},{"name":"subcategory_output/kernel","shape":[64,15],"dtype":"float32"},{"name":"subcategory_output/bias","shape":[15],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}